/*   ______   ___       ___         ____     ______  ____
*   /\  _  \ /\_ \    /'___\       /\  _`\  /\  _  \/\  _`\
*   \ \ \L\ \\//\ \  /\ \__/   __  \ \ \/\_\\ \ \L\ \ \ \/\ \
*    \ \  __ \ \ \ \ \ \ ,__\/'__`\ \ \ \/_/_\ \  __ \ \ \ \ \
*     \ \ \/\ \ \_\ \_\ \ \_/\ \L\.\_\ \ \L\ \\ \ \/\ \ \ \_\ \
*      \ \_\ \_\/\____\\ \_\\ \__/.\_\\ \____/ \ \_\ \_\ \____/
*       \/_/\/_/\/____/ \/_/ \/__/\/_/ \/___/   \/_/\/_/\/___/
*
*   A CAD
*
*   By Marek Ratajczak 2024
*
*   See readme_alfacad.txt for copyright information.
*
*/

#ifdef __MESSAGE__

static char* komunikaty[] =
/*0*/{u8"",
/*1*/u8"Дані в порядку",
/*2*/u8"Зачекай ...",
/*3*/u8"Переривання --> Esc",
/*4*/u8"Зміна структури даних, зачекайте ...",
/*5*/u8"Тест даних ...",
/*6*/u8"",
/*7*/u8"Зачекайте: тестування структури блоків. Переривання --> Esc",
/*8*/u8"Зачекайте: видалення блоків ...",
/*9*/u8"Налаштування вікна збережено.",
};

static char* messages[] =
{
	/*0*/u8"%s",
	/*1*/u8"Переривання --> Esc (%s%%)",
	/*2*/u8"ЗАЧЕКАЙТЕ -> розривні рядки: (%s%%)",
	/*3*/u8"Буферизація зображення (%s) Переривання --> Esc",
};

static char* messages1[] =
{
	/*0*/u8"%s",
	/*1*/u8"Переривання --> Esc (%s%%)",
	/*2*/u8"ЗАЧЕКАЙТЕ -> розривні рядки: (%s%%)",
};

static char* errors_kom[] =
/* 0*/{ u8"",
/* 1*/u8"Відстань між сіткою замале, сітка не відображатиметься",
/* 2*/u8"Неправильний формат дійсного числа",
/* 3*/u8"Неправильний формат параметра",
/* 4*/u8"Файл макросу не знайдено.",
/* 5*/u8"Занадто великий розмір формату",
/* 6*/u8"Занадто великий файл макросу",
/* 7*/u8"Неправильні або відсутні дані конфігурації плоттера",
/* 8*/u8"Диск повний або невдала робота з диском",
/* 9*/u8"Неправильний формат додатного цілого числа",
/* 10*/u8"Неправильний або відсутній файл конфігурації ініціації плоттера",
/* 11*/u8"Неможливо завантажити файл шрифту. Неправильний формат файлу шрифту",
/* 12*/u8"Недостатньо пам'яті для завантаження файлу шрифту",
/* 13*/u8"Екран за межами формату малювання",
/* 14*/u8"Дочірній процес не запущено",
/* 15*/u8"Внутрішня помилка. Повідомити розробнику.",
/* 16*/u8"Неправильний формат числа",
/* 17*/u8"Відсутній шрифт",
/* 18*/u8"Немає пам'яті",
/* 19*/u8"Об'єкт не знайдено",
/* 20*/u8"Неправильні параметри",
/* 21*/u8"Перевищено обмеження розміру блоку (макс. 2 ГБ)",
/* 22*/u8"Неправильні або відсутні дані про типи рядків",
/* 23*/u8"Внутрішня помилка. Повідомити розробнику.",
/* 24*/u8"Неправильний формат додатного цілого числа",
/* 25*/u8"Неправильний формат файлу",
/* 26*/u8"Неправильні або відсутні дані конфігурації принтера",
/* 27*/u8"Переповнення буфера макросу",
/* 28*/u8"Неправильне ім'я файлу",
/* 29*/u8"Пряні не можуть бути паралельними",
/* 30*/u8"Неправильний формат позитивного дійсного числа",
/* 31*/u8"Файл не знайдено або помилка читання файлу",
/* 32*/u8"Радіус дуги завеликий",
/* 33*/u8"Немає пам'яті",
/* 34*/u8"Радіус дуги замалий або неправильний формат числа",
/* 35*/u8"Неправильний ненульовий формат дійсного числа",
/* 36*/u8"Більше не можна створювати шари",
/* 37*/u8"Поточний шар не може бути невидимим",
/* 38*/u8"Неправильний формат даних, радіус дуги <= 0 ",
/* 39*/u8"Неправильний формат даних, радіус кола <= 0 ",
/* 40*/u8"Неправильний формат даних",
/* 41*/u8"Друк припинено або помилка друку.",
/* 42*/u8"Помилка друку. Продовжити / Завершити:",
/* 43*/u8"Помилка пристрою. Продовжити / Завершити:",
/* 44*/u8"Вибраний об'єкт не належить до блоку.",
/* 45*/u8"Неправильний формат файлу.",
/* 46*/u8"Неправильний диск або папка.",
/* 47*/u8"Новий малюнок",
/* 48*/u8"Помилка запису файлу.",
/* 49*/u8"Файл не знайдено",
/* 50*/u8"Увага: об'єкти останнього блоку знаходяться на шарі '-V'",
/* 51*/u8"Неправильний формат файлу конфігурації ALFACAD.INI",
/* 52*/u8"Операцію неможливо виконати.",
/* 53*/u8"Об'єкти не видалені.",
/* 54*/u8"Увага: об'єкти останнього блоку знаходяться на шарі '-E'",
/* 55*/u8"Неправильні цифри",
/* 56*/u8"Блок містить дуги, масштабні коефіцієнти X і Y повинні бути рівні.",
/* 57*/u8"Помилка у виразі.",
/* 58*/u8"Ділення на 0.",
/* 59*/u8"Відсутня закриваюча дужка.",
/* 60*/u8"Це не функція.",
/* 61*/u8"Неправильна кількість аргументів функції.",
/* 62*/u8"Функція вимагає невід'ємного аргументу.",
/* 63*/u8"Невизначена змінна або функція.",
/* 64*/u8"Дужка '(' очікується.",
/* 65*/u8"Аргумент математичної функції поза діапазоном.",
/* 66*/u8"Кут дуги дорівнює 0.",
/* 67*/u8"Неправильний номер сторінки.",
/* 68*/u8"Дозволена кількість ребер: 3 - 1024.",
/* 69*/u8"Блок не знайдено.",
/* 70*/u8"Кількість блоків перевищує допустиму кількість 2000.",
/* 71*/u8"Немає сегментів ескізу для видалення.",
/* 72*/u8"Блок з недійсними параметрами розгорнуто.",
/* 73*/u8"Радіус дуги не може бути < 0.",
/* 74*/u8"Радіус кола не може бути < 0.",
/* 75*/u8"Неправильний формат двох натуральних чисел.",
/* 76*/u8"Немає сегментів сліду для видалення.",
/* 77*/u8"Немає сегментів полілінії для видалення.",
/* 78*/u8"Недопустима рекурсія",
/* 79*/u8"Неправильний формат ненульового дійсного числа.",
/* 80*/u8"Вибраний об'єкт знаходиться на шарі '-E'.",
/* 81*/u8"Вибраний сегмент полілінії не може бути продовжений.",
/* 82*/u8"Повинен бути виділений сегмент полілінії.",
/* 83*/u8"Ви можете скруглити лише два сусідніх сегмента полілінії.",
/* 84*/u8"Радіус дуги замалий.",
/* 85*/u8"Ви можете скруглити лише зовнішні сегменти полілінії.",
/* 86*/u8"Ви можете зняти фаску лише двох сусідніх сегментів полілінії.",
/* 87*/u8"Вибрані об'єкти не утворюють закриту область.",
/* 88*/u8"Вказана точка не лежить у закритій зоні.",
/* 89*/u8"Функція не є безперервною в початковій точці",
/* 90*/u8"Функція має забагато точок розриву",
/* 91*/u8"Об'єкти вибраного блоку знаходяться на шарах '-V'.",
/* 92*/u8"Об'єкти вибраного блоку знаходяться на шарах '-E'.",
/* 93*/u8"Неправильно визначений кут локальної системи координат (dx=0,dy=0)",
/* 94*/u8"Немає блоку в буфері обміну",
/* 95*/u8"Недостатнє виділення пам'яті для ініціалізації меню",
/* 96*/u8"Недостатнє виділення пам'яті для макробуфера та шарів",
/* 97*/u8"Недостатнє виділення пам'яті для ініціалізації даних",
/* 98*/u8"Недостатнє виділення пам'яті для ініціалізації даних малювання",
/* 99*/u8"Неправильний формат файлу або недостатнє виділення пам'яті для завантаження вкладеного малюнка",
/*100*/u8"Помилка читання вкладеного малюнка",
/*101*/u8"Недостатньо виділеної пам'яті для читання робочого файлу 'RYSUJ.$2'",
/*102*/u8"Помилка читання робочого файлу RYSUJ.$2",
/*103*/u8"Помилка відкриття файлу даних ALFPROF.TMP",
/*104*/u8"Помилка зчитування даних ALFPROF.TMP",
/*105*/u8"Відстань не може бути < 0",  //////////////////////////////////////////
/*106*/u8"",
/*107*/u8"",
/*108*/u8"",
/*109*/u8"",
/*110*/u8"",
/*111*/u8"",
/*112*/u8"",
/*113*/u8"",
/*114*/u8"",
/*115*/u8"",
/*116*/u8"",
/*117*/u8"",
/*118*/u8"",
/*119*/u8"",
/*120*/u8"",
/*121*/u8"",
/*122*/u8"",
/*123*/u8"",
/*124*/u8"Примітка: локальна початкова точка <0,0> знаходиться в глобальній початковій точці 0,0. Натисніть будь-яку клавішу:",
/*125*/u8"",
/*126*/u8"",
/*127*/u8"",
/*128*/u8"",
/*129*/u8"",
/*130*/u8"",
/*131*/u8"",
/*132*/u8"",
/*133*/u8"",
/*134*/u8"",
/*135*/u8"",
/*136*/u8"",
/*137*/u8"",
/*138*/u8"",
/*139*/u8"",
/*140*/u8"",
/*141*/u8"",
/*142*/u8"",
/*143*/u8"",
/*144*/u8"",
/*145*/u8"",
/*146*/u8"",
/*147*/u8"",
/*148*/u8"",
/*149*/u8"",
/*150*/u8"",
/*151*/u8"",
/*152*/u8"",
/*153*/u8"",
/*154*/u8"",
/*155*/u8"",
/*156*/u8"",
/*157*/u8"",
/*158*/u8"",
/*159*/u8"",
/*160*/u8"",
/*161*/u8"",
/*162*/u8"",
/*163*/u8"",
/*164*/u8"",
/*165*/u8"",
/*166*/u8"",
/*167*/u8"",
/*168*/u8"",
/*169*/u8"",
/*170*/u8"Помилка перетворення файлу DXF.",
/*171*/u8"Символ Mo в каталозі",
/*172*/u8"Неправильна версія файлу DXF (дозволені версії: R9, R10, R11, R12, R13, R14, 2000)",
/*173*/u8"Забагато файлів (макс. 1000)",
/*174*/u8"",
/*175*/u8"",
/*176*/u8"",
/*177*/u8"",
/*178*/u8"",
/*179*/u8"",
/*180*/u8"",
/*181*/u8"",
/*182*/u8"",
/*183*/u8"",
/*184*/u8"",
/*185*/u8"",
/*186*/u8"",
/*187*/u8"",
/*188*/u8"",
/*189*/u8"",
/*190*/u8"",
/*191*/u8"",
/*192*/u8"",
/*193*/u8"",
/*194*/u8"",
/*195*/u8"",
/*196*/u8"Поточний шар не можна видалити!",
/*197*/u8"",
/*198*/u8"",
/*199*/u8"",
/*200*/u8"",
/*201*/u8"Довжина вектора має бути більшою за нуль",
/*202*/u8"Помилка читання файлу зображення",
/*203*/u8"",
/*204*/u8"",
/*205*/u8"",
/*206*/u8"",
/*207*/u8"",
/*208*/u8"",
/*209*/u8"",
/*210*/u8"Примусовий рівень '0' встановлений як +V +E +P",
/*211*/u8"Внутрішня помилка",
/*212*/u8"Код помилки: ",
/*213*/u8"Значення за межами діапазону 1024 .. 2000000 [КБ]",
/*214*/u8"Номер шару за межами діапазону 1...256",
/*215*/u8"Жодна з півосей еліпса не може мати довжину менше 0.",
/*216*/u8"Неправильний формат для невід'ємного дійсного числа",
};

static char* komunikaty_kom[] =
/* 0*/{ u8"",
/* 1*/u8"Введіть розмір: ",
/* 2*/u8"Введіть множники координат X;Y : ",
/* 3*/u8"Малюнок не збережено. Зберегти у файл ? (Так / Ні / Esc): ",
/* 4*/u8"Введіть формат аркуша креслення: ",
/* 5*/u8"Введіть ім'я файлу для збереження: ",
/* 6*/u8"Введіть масштаб малюнка: 1: ",
/* 7*/u8"Введіть крок курсору: ",
/* 8*/u8"Введіть щільність сітки: ",
/* 9*/u8"Введіть ім'я файлу для читання: ",
/*10*/u8"Введіть висоту символу: ",
/*11*/u8"Введіть опис блоку: ",
/*12*/u8"Функція неактивна.",
/*13*/u8"Введіть текст: ",
/*14*/u8"Введіть тип блоку: ",
/*15*/u8"Введіть кут: ",
/*16*/u8"Введіть кут повороту блоку: ",
/*17*/u8"Введіть коефіцієнт масштабування блоку: ",
/*18*/u8"У демонстраційній версії функція неактивна.",
/*19*/u8"Введіть мінімальну довжину сегмента ескізу: ",
/*20*/u8"Введіть кут заповнення: ",
/*21*/u8"Введіть кількість елементів: ",
/*22*/u8"Стрибок на dX ; dY : ",
/*23*/u8"Перейти до X ; Y : ",
/*24*/u8"Введіть ширину трасування: ",
/*25*/u8"Введіть розмір точки: ",
/*26*/u8"Введіть ім'я файлу: ",
/*27*/u8"Введіть кількість сегментів поділу: ",
/*28*/u8"Вказати на",
/*29*/u8"Введіть довжину сегмента поділу: ",
/*30*/u8"Стрибок за довжиною - кут : ",
/*31*/u8"Масштаб оригіналу : ",
/*32*/u8"Кут повороту оригіналу : ",
/*33*/u8"Коефіцієнт ширини тексту: ",
/*34*/u8"Висота розмірного тексту: ",
/*35*/u8"Точність розмірів: ",
/*36*/u8"Зміщення розмірної лінії: ",
/*37*/u8"Відстань тексту від розмірної лінії: ",
/*38*/u8"Зміщення початкової точки виносної лінії: ",
/*39*/u8"Введіть точність малювання (мм) : ",
/*40*/u8"Вікно",
/*41*/u8"Видалити розтягнення",
/*42*/u8"Початок",
/*43*/u8"Кінець",
/*44*/u8"Зовнішня програма : ",
/*45*/u8"Введіть інтервал: ",
/*46*/u8"Переривання -> Esc",
/*47*/u8"Введіть кількість рядків і стовпців r;c : ",
/*48*/u8"Введіть довжину відрізка: ",
/*49*/u8"Введіть максимальну кількість точок поділки: ",
/*50*/u8"Переглянути каталоги? (Так / Ні / Esc) : ",
/*51*/u8"Відстань між рядками: ",
/*52*/u8"Початкова точка штрихування: ",
/*53*/u8"Введіть кількість вершин полілінії, що апроксимує еліпс: ",
/*54*/u8"Введіть крок апроксимації dx : ",
/*55*/u8"Введіть функцію f(x) : ",
/*56*/u8"Калькулятор : ",
/*57*/u8"Змінити сторінку, натисніть будь-яку клавішу",
/*58*/u8"Видалити виділені об'єкти? (Так / Ні / Esc) : ",
/*59*/u8"",
/*60*/u8"Видалити вкладений малюнок? (Так / Ні / Esc) : ",
/*61*/u8"Немає вкладеного малюнка ...",
/*62*/u8"Натисніть клавішу Esc...",
/*63*/u8"Введіть кут місцевої системи координат: α =",
/*64*/u8"Ви впевнені, що хочете програму виходу? (Так / Ні / Esc)",
/*65*/u8"",
/*66*/u8"Точка -> точно кінець",
/*67*/u8"Точка -> найближчий  кінець",
/*68*/u8"Точка -> медіана (середня точка)",
/*69*/u8"Точка -> перетин",
/*70*/u8"Точка -> центр",
/*71*/u8"Точка -> перпендикулярний",
/*72*/u8"Точка -> дотичній",
/*73*/u8"Точка -> суміжний",
/*74*/u8"Точка -> точка",
/*75*/u8"Точкова лінія для визначення кута",
/*76*/u8"Вибраний об'єкт не належить до блоку.",
/*77*/u8"Вибраний об'єкт знаходиться на шарі '-E'.",
/*78*/u8"Об'єкти виділеного блоку знаходяться на шарах '-V'.",
/*79*/u8"Об'єкти виділеного блоку знаходяться на шарах '-E'.",
/*80*/u8"Виберіть об'єкт, щоб визначити шар",
/*81*/u8"Введіть номер кольору (0..255) : ",
/*82*/u8"Виберіть об'єкт, щоб визначити колір",
/*83*/u8"Виберіть об'єкт, щоб визначити тип і ширину / параметри тексту",
/*84*/u8"Заморожені блоки не підірвалися.",
/*85*/u8"Незаморожені блоки не були підірвані.",
/*86*/u8"Вказаний текст не є ім'ям файлу.",
/*87*/u8"Ви вже перебуваєте в корені деревоподібної структури",
/*88*/u8"Текст не знайдено.",
/*89*/u8"Обережно: забагато об'єктів 'PIN' в розтягнутому блоці.",
/*90*/u8"Введіть ТИП пристрою: ",
/*91*/u8"Введіть СИМВОЛ пристрою: ",
/*92*/u8"Введіть КОМЕНТАР: ",
/*93*/u8"Неправильне визначення поділу. Натисніть будь-яку клавішу ...",
/*94*/u8"Введіть тип (ім'я) символу: ",
/*95*/u8"Увага: створено замінні пристрої (*). Доповніть схему",
/*96*/u8"Введіть масштаб перегляду: ",
/*97*/u8"Введіть назву схеми + : ",
/*98*/u8"Введіть назву файлу Scheme + : ",
/*99*/u8"Введіть координати вибраної точки: ",
/*100*/u8"Введіть одиницю креслення у файл DXF: ",
/*101*/u8"Введіть масштаб трансформації файлу DXF: ",
/*102*/u8"Введіть текст пошуку: ",
/*103*/u8"Пошук: ",
/*104*/u8"Змінити на: ",
/*105*/u8"Добре",
/*106*/u8"Введіть зміщення осі відносно центру симетрії траси: ",
/*107*/u8"У цій версії програми функція тимчасово неактивна.",
/*108*/u8"Введіть назву нового підкаталогу: ",
/*109*/u8"Видалити прототипи блоків? (Так / Ні / Esc) : ", //////////////////////////
/*110*/u8"Виберіть об'єкт, щоб отримати список параметрів",
// /*111*/u8"Виберіть рядок, щоб додати параметр до списку буфера обміну, або натисніть Esc",
/*111*/u8"Виберіть рядок, щоб редагувати або додати параметр до списку буфера обміну, або натисніть Esc",
/*112*/u8"Виберіть початкову точку штрихування: ",
/*113*/u8"Введіть розмір точки dx [мм]: ",
/*114*/u8"Введіть розмір точки dy [мм]: ",
/*115*/u8"Максимальна кількість шарів: 256",
/*116*/u8"Мінімальна кількість шарів: 1",
/*117*/u8"Шар не існує.",
/*118*/u8"Перший символ: ",
/*119*/u8"Файл не збережено. Бажаєте зберегти його? (Так / Ні / Esc): ",/*120*/u8"",
/*121*/u8"",
/*122*/u8"",
/*123*/u8"",
/*124*/u8"",
/*125*/u8"",
/*126*/u8"",
/*127*/u8"",
/*128*/u8"",
/*129*/u8"",
/*130*/u8"",
/*131*/u8"",
/*132*/u8"",
/*133*/u8"",
/*134*/u8"",
/*135*/u8"",
/*136*/u8"Введіть префікси номерів зон: ",
/*137*/u8"Введіть номер першої зони: ",
/*138*/u8"Введіть висоту зони [мм] : ",
/*139*/u8"Введіть ширину зони [мм] : ",
/*140*/u8"Введіть ширину поля зони [мм] : ",
/*141*/u8"Введіть зміщення кадру зон [мм] : ",
/*142*/u8"",
/*143*/u8"",
/*144*/u8"Введіть координату Z: ",
/*145*/u8"",
/*146*/u8"",
/*147*/u8"",
/*148*/u8"",
/*149*/u8"",
/*150*/u8"",
/*151*/u8"",
/*152*/u8"",
/*153*/u8"",
/*154*/u8"Введіть коефіцієнт автопанорами 0,01...1 : ",
/*155*/u8"",
/*156*/u8"",
/*157*/u8"",
/*158*/u8"",
/*159*/u8"",
/*160*/u8".......... Щоб ігнорувати фон під час друку?",
/*161*/u8"Вибрати колір фону (або ESC)",
/*162*/u8"Ігнорувати фон?",
/*163*/u8"Вибрати накладений колір точок зображення (або ESC)",
/*164*/u8"Інверсія Ч/Б на роздруківці?",
/*165*/u8"",
/*166*/u8"",
/*167*/u8"",
/*168*/u8"",
/*169*/u8"",
/*170*/u8"",
/*171*/u8"",
/*172*/u8"",
/*173*/u8"Вибрані об'єкти не утворюють закриту область.",
/*174*/u8"",
/*175*/u8"",
/*176*/u8"",
/*177*/u8"",
/*178*/u8"",
/*179*/u8"",
/*180*/u8"",
/*181*/u8"",
/*182*/u8"Наведіть блок аркуша (@SHEET)",
/*183*/u8"Редагувати блок зображення?",
/*184*/u8"Введіть кут повороту блоку зображення: ",
/*185*/u8"Перезавантажити відредагований блок зображення? (Так / Ні / Esc): ",
/*186*/u8"",
/*187*/u8"",
/*188*/u8"",
/*189*/u8"",
/*190*/u8"",
/*191*/u8"Наведіть вказівник на об'єкт, щоб вказати прихований шар",
/*192*/u8"Кількість вершин полілінії, що апроксимує коло або дугу, масштабована в анізотропному масштабі: ",
/*193*/u8"Введіть значення за замовчуванням максимального розміру пам'яті для малювання [КБ]: ",
/*194*/u8"Введіть значення за замовчуванням буфера друку [КБ]: ",
/*195*/u8"Вкажіть номер шару: ",
/*196*/u8"Виберіть область, заповнену візерунком, суцільну або слід, щоб визначити параметри заливки",
/*197*/u8"Виберіть область, заповнену візерунком, суцільну або слід, щоб змінити параметри заливки",
/*198*/u8"Введіть фіксований масштабний коефіцієнт блоку: ",
/*199*/u8"Введіть коефіцієнт зміни масштабу сили: ",
/*200*/u8"Введіть коефіцієнт зміни масштабу моменту: ",
/*201*/u8"Введіть коефіцієнт зміни масштабу переміщення: ",
/*202*/u8"Введіть коефіцієнт зміни масштабу обертання: ",
/*203*/u8"Введіть коефіцієнт зміни масштабу навантаження: ",
/*204*/u8"Введіть коефіцієнт зміни теплового навантаження: ",
/*205*/u8"Введіть точність сили: ",
/*206*/u8"Введіть точність моменту: ",
/*207*/u8"Введіть точність зміщення: ",
/*208*/u8"Введіть точність обертання: ",
/*209*/u8"Введіть точність завантаження: ",
/*210*/u8"Введіть точність теплового навантаження: ",
/*211*/u8"Введіть номер властивості: ",

/*212*/u8"Введіть коефіцієнт зміни масштабу для результуючих осьових сил: ",
/*213*/u8"Введіть коефіцієнт зміни масштабу для результуючих зсувних зусиль: ",
/*214*/u8"Введіть коефіцієнт зміни масштабу для результуючих згинальних моментів: ",
/*215*/u8"Введіть коефіцієнт зміни масштабу для результуючих переміщень: ",
/*216*/u8"Введіть коефіцієнт зміни масштабу для результуючих сил опорної реакції: ",
/*217*/u8"Введіть коефіцієнт зміни масштабу для результуючих моментів реакції підтримки: ",

/*218*/u8"Введіть коефіцієнт зміни глибини розділу: ",
/*219*/u8"Введіть коефіцієнт зміни масштабу для результуючих напруг (сталь, деревина): ",
/*220*/u8"Введіть точність напруги: ",
/*221*/u8"Введіть коефіцієнт перебільшення деформації режимів модальних коливань: ",
/*222*/u8"Введіть коефіцієнт зміни масштабу для результуючий відсоток армування: ",
/*223*/u8"Введіть коефіцієнт масштабування поверхневого навантаження: ",
/*224*/u8"Введіть коефіцієнт масштабування результуючих напружень (залізобетон): ",
"",
"",
};

static char* komunikaty0[] =
/*0*/{ u8"",
/*1*/u8"Текст",
/*2*/u8"Розтягнути - до точки",
/*3*/u8"Розтягнути - від точки",
/*4*/u8"Перемістити - з точки",
/*5*/u8"Перемістити - до точки",
/*6*/u8"Визначення розмірів",
/*7*/u8"Лінія від точки",
/*8*/u8"Лінія в точку",
/*9*/u8"Коло - центр",
/*10*/u8"Коло - редіус",
/*11*/u8"Філе - вибрати перший рядок",
/*12*/u8"Філе - вибрати другий рядок",
/*13*/u8"Дуга - три точки",
/*14*/u8"Дуга - початок-центр-кінець",
/*15*/u8"Дуга - початок-центр-кут",
/*16*/u8"Дуга - початок-центр-акорд",
/*17*/u8"Дуга - початок-кінець-радіус",
/*18*/u8"Дуга - початок-кінець-кут",
/*19*/u8"Дуга - початок-кінець-напрямок",
/*20*/u8"Дуга - продовження",
/*21*/u8"Вибрати об'єкти для видалення",
/*22*/u8"Вибрати об'єкти для переміщення",
/*23*/u8"Вибрати об'єкти для копіювання",
/*24*/u8"Копіювати - з точки",
/*25*/u8"Копіювати - в точку",
/*26*/u8"Вибрати об'єкти для масштабування",
/*27*/u8"Базова точка",
/*28*/u8"Масштаб",
/*29*/u8"Намалюй квадрат",
/*30*/u8"Вікно з точки",
/*31*/u8"Вікно в точку",
/*32*/u8"Вибрати об'єкти для обертання",
/*33*/u8"Обертання",
/*34*/u8"Вибрати за кадром об'єкти для розтягування",
/*35*/u8"Недостатньо пам'яті",
/*36*/u8"Вибрати об'єкти для збереження у файлі",
/*37*/u8"Позначити точку вставки (Home +90°, End -90°)",
/*38*/u8"Переріз профілю",
/*39*/u8"Редагувати текст",
/*40*/u8"Колір, кут, висота, шрифт", 
/*41*/u8"Виберіть блоки для вибуху",
/*42*/u8"Диск - центр",
/*43*/u8"Диск - радіус",
/*44*/u8"Фаска - вибрати перший рядок",
/*45*/u8"Фаска - виберіть другий рядок",
/*46*/u8"Розрив - вибір об'єкта",
/*47*/u8"Перейти - позначити першу точку",
/*48*/u8"Перейти - позначити другу точку",
/*49*/u8"Автозбереження у файл BACKUP.ALF",
/*50*/u8"Вибрати об'єкт для зміни властивостей",
/*51*/u8"Вибрати краї для розширення",
/*52*/u8"Вибрати об'єкти для розширення",
/*53*/u8"Позначити вершину області",
/*54*/u8"Позначити точку",
/*55*/u8"Відстань - перша точка",
/*56*/u8"Відстань - друга точка",
/*57*/u8"Многокутник - перша точка сторони",
/*58*/u8"Многокутник - вписаний у коло",
/*59*/u8"Многокутник - описаний на колі",
/*60*/u8"Многокутник - друга точка сторони",
/*61*/u8"Многокутник - радіус кола",
/*62*/u8"Ескіз -Позначити початкову точку",
/*63*/u8"Ескіз",
/*64*/u8"Вибрати об'єкт для групування",
/*65*/u8"Копіювати паралельно (зміщення) в точку",
/*66*/u8"Копіювати паралельно (зміщення) на відстань",
/*67*/u8"Вибрати об'єкт для паралельного копіювання (зміщення)",
/*68*/u8"Вибрати ріжучі кромки",
/*69*/u8"Вибрати об'єкт для вирізання",
/*70*/u8"Вибрати об'єкт для дзеркала",
/*71*/u8"Перша точка лінії симетрії (вісь)",
/*72*/u8"Друга точка лінії симетрії (вісь)",
/*73*/u8"Вибрати об'єкти для прямокутного копіювання",
/*74*/u8"Вибрати об'єкти для полярного копіювання",
/*75*/u8"Позначити прямокутником відстані між стовпцями та рядками",
/*76*/u8"Вибрати центральну точку",
/*77*/u8"Вибрати базову точку",
/*78*/u8"Слід від точки",
/*79*/u8"Відстеження до точки",
/*80*/u8"Полілінія від точки",
/*81*/u8"Вибрати лінію або дугу для продовження",
/*82*/u8"Вибрати об'єкт для поділу",
/*83*/u8"Вибрати об'єкт для вимірювання",
/*84*/u8"Кут - третя точка",
/*85*/u8"Кут - перша точка",
/*86*/u8"Кут - друга точка",
/*87*/u8"Вказати межі штрихування",
/*88*/u8"Вкажіть внутрішню частину області (Home +45°, End -45°, PgUp +3°, PgDn -3°)",
/*89*/u8"Вкажіть початок першої осі еліпса",
/*90*/u8"Вкажіть кінець першої осі еліпса",
/*91*/u8"Вкажіть центр еліпса",
/*92*/u8"Вкажіть довжину другої півосі",
/*93*/u8"Вкажіть початкову точку діаграми",
/*94*/u8"Вкажіть кінцеву точку діаграми",
/*95*/u8"Вибрати об'єкти для миттєвого видалення",
/*96*/u8"",
/*97*/u8"Вкажіть межі території",
/*98*/u8"Вкажіть внутрішню частину області",
/*99*/u8"",
/*100*/u8"2 рядки від точки",
/*101*/u8"2 рядок до точки",
/*102*/u8"Вісь - перша точка",
/*103*/u8"Вісь - Друга точка",
/*104*/u8"3-рядок від точки",
/*105*/u8"3 рядки до точки",
/*106*/u8"Зміна формату даних креслення...",
/*107*/u8"Оновлення креслення в новому форматі",
/*108*/u8"Зміна формату даних блоку...",
/*109*/u8"Оновлення блоку в новому форматі",
/*110*/u8"Полілінія від точки",
/*111*/u8"Полілінія до точки",
/*112*/u8"Виберіть заморожені блоки (*,$), щоб вибухнути",
/*113*/u8"Вхід -> вкажіть назву файлу креслення",
/*114*/u8"Вказати розміри пристрою",
/*115*/u8"Вказати розміри схеми +",
/*116*/u8"Вибрати об'єкти для специфікації пристроїв",
/*117*/u8"Вказати розміри прямокутника",
/*118*/u8"Вибрати тексти для зміни",
/*119*/u8"Виберіть тексти (символи) для зміни",
/*120*/u8"Бібліотека символів -> виберіть символ:",
/*121*/u8"Текст (PgUp +3°, PgDn -3°, Home +90°, End -90°, 'Р' Редагування)",
/*122*/u8"Вкажіть внутрішню частину області (Home +45°, End -45°, PgUp +3°, PgDn -3°)",
/*123*/u8"Позначте початкову точку кривої Без'є",
/*124*/u8"Позначте контрольну точку кривої Без'є",
/*125*/u8"",
/*126*/u8"Вісь від точки:",
/*127*/u8"Вісь до точки:",
/*128*/u8"читання...",
/*129*/u8"очікування...",
/*130*/u8"",
/*131*/u8"",
/*132*/u8"",
/*133*/u8"Вибрати об'єкти для збереження в буфер обміну",
/*134*/u8"Виберіть зображення, щоб змінити властивості",
/*135*/u8"Вибрати зображення для експорту",
/*136*/u8"Буферизація зображень",
/*137*/u8"Переривання --> Esc",
/*138*/u8"Виберіть блок штрихування, щоб змінити шаблон (Home +45°, End -45°, PgUp +3°, PgDn -3°)",
/*139*/u8"Вкажіть внутрішню частину області (Home +90°, End -90°)",
/*140*/u8"Вкажіть внутрішню частину області",
/*141*/u8"Виберіть сплайн, щоб змінити напруги",
/*142*/u8"Вкажіть величину напруженості",
/*143*/u8"Панорамування від точки",
/*144*/u8"Панорамування до точки",
/*145*/u8"Провідна лінія від точки",
/*146*/u8"Провідна лінія до точки",
/*147*/u8"Виберіть об’єкт для чотирикутного перетворення",
/*148*/u8"Перетворення файлу у формат BMP",
/*149*/u8"Перетворення файлу у формат PBM",
/*150*/u8"Перетворення файлу у формат ALX",
/*151*/u8"Вкажіть початковий кут еліптичної дуги",
/*152*/u8"Вкажіть крайній кут еліптичної дуги",
/*153*/u8"Виберіть лінію або сторону багатокутника або тіла, до яких повинен бути еліпс тангенціальний",
/*154*/u8"Вкажіть на еліпсі розташування точки для визначення другої піввісь",
/*155*/u8"Вектор від точки",
/*156*/u8"Вектор в точку",
/*157*/u8"Вектор від точки  (Home->зворотні стрілки, End->поміняти значення)",
/*158*/u8"Вектор в точку  (Home->зворотні стрілки, End->поміняти значення)",
/*159*/u8"",
/*160*/u8"",
/*161*/u8"",
/*162*/u8"",
/*163*/u8"",
/*164*/u8"",
/*165*/u8"",
/*166*/u8"",  //custom text
/*167*/u8"Вкажіть схему рами або ферми для статичного/динамічного аналізу",
/*168*/u8"Визначення розмірів (щоб почати нанесення розмірів кута, торкніться будь-якої лінії)",
/*169*/u8"Вкажіть елемент каркаса або ферми",
/*170*/u8"Розташуйте лінію перетину за потрібними координатами елемента. Натисніть, щоб зберегти значення в буфер обміну",
/*171*/u8"Вкажіть схему плити для статичного розрахунку (МКЕ)",
};

static char* messages_str[] =
/*0*/{u8"Дуга - початок-точка-кінець",
/*1*/u8"Дуга - початок-центр-кінець",
/*2*/u8"Дуга - початок-центр-кут",
/*3*/u8"Дуга - початок-центр-акорд",
/*4*/u8"Дуга - початок-кінець-радіус",
/*5*/u8"Дуга - початок-кінець-кут",
/*6*/u8"Дуга - початок-кінець-напрямок",
/*7*/u8"Дуга - продовження",
/*8*/u8"",
/*9*/u8"Файл %s",
/*10*/u8"%s - ЦЕНТР - радіус",
/*11*/u8"%s - центр - RADIUS",
/*12*/u8"%s - центр - ДИАМЕТР",
/*13*/u8"%s - перша точка діаметра",
/*14*/u8"%s - друга точка діаметра",
/*15*/u8"%s - перша точка",
/*16*/u8"%s - друга точка",
/*17*/u8"%s - третя точка",
/*18*/u8"%s - вибрати перший об'єкт",
/*19*/u8"%s - вибрати другий об'єкт",
/*20*/u8"%s - ЦЕНТР - діаметр",
/*21*/u8"",
/*22*/u8"",
/*23*/u8"DXF-> %s",
/*24*/u8"%s - перша точка радіуса",
/*25*/u8"%s - друга точка радіуса",
};

#define ORTHO u8"   Орто."
#define _LAYER_ u8"Шар"
#define _MODE_ u8"Режим"
#define _V_ u8"В"
#define _E_ u8"Р"
#define _P_ u8"Л"

static char gg[10][36] = { u8"Кінець", u8"Найближчий кінець", u8"Середина", u8"Перетин", u8"Центр", u8"pРостопад",
					u8"Тангенс", u8"Найближчий", u8"точка", u8"----" };

#endif

#ifdef __O_LUK__
/*static*/ char* komunikaty_arc[] = {
    u8"Дуга - початок-точка-кінець",
	u8"Дуга - початок-центр-кінець",
	u8"Дуга - початок-центр-кут",
	u8"Дуга - початок-центр-акорд",
	u8"Дуга - початок-кінець-радіус",
	u8"Дуга - початок-кінець-кут",
	u8"Дуга - початок-кінець-напрям",
	u8"Дуга - продовження", };

#define r6 11

#endif

#ifdef __BUF__

#define _NOT_ENOUGH_MEMORY_ u8"НЕДОСТАТНО ПАМ’ЯТІ АБО ПОМИЛКА ПРОГРАМИ"

#endif

#ifdef __DXF_O__

#define _PCX_FILE_ERROR_  u8"Помилка запису файлу PCX"
#define _PNG_FILE_ERROR_  u8"Помилка запису файлу PNG"
#define _UNKNOWN_IMAGE_FORMAT_ u8"Невідомий формат файлу зображення"
#define _FILE_ u8"Файл "
#define _FILE_EXISTS_ u8" існує. Перезаписати це? (Так/Ні/Esc):"

#define _YES_NO_ESC_ u8"ТтНн\033"
#define _YES_ L'Т'
#define _yes_ L'т'
#define _NO_ L'Н'
#define _no_ L'н'

#endif

#ifdef __O_ZB__

#define _DRAWING_V_1_ u8"Креслення <вер.1.0> Спочатку конвертуйте за допомогою ALF v.1.1 - 1.9"
#define _BLOCK_V_1_ u8"Блок <вер.1.0>. Конвертувати, якщо використовується ALF v.1.1 - 1.9"

#define VECTORIZATION u8"Векторизація"

POLE pmNie_Tak[] = {
	{u8"Ні",L'Н',113,NULL},
	{u8"Так",L'Т',112,NULL} };

char zb_err_message[] = u8"Помилка конвертації файлу. Код виходу:";
char zb_err_message1[] = u8"Помилка конвертації файлу";
char zb_unknown[] = u8"Незнаний";
static char zb_confirm[] = u8"Підтвердьте";

#define _FILE_CONVERSION_ERROR_ u8"Помилка перетворення файлу"
#define _INCORRECT_FILE_FORMAT_ u8"Неправильний формат файлу"
#define _ERROR_WREITING_AUX_FILE_ u8"Помилка запису допоміжного файлу"
#define _FILE_NOT_FOUND_ u8"Файл не знайдено "

static char* vectorization_param[] =
{
    u8"Шкала PBM",
    u8"Інтерполяція PBM",
    u8"поріг PBM",
    u8"Розворот PBM",
    u8"Фільтр PBM",
    u8"без фільтра PBM",
    u8"Шкала ALX",
    u8"Рівень чорного ALX",
    u8"розмір плями ALX",
    u8"Кутовий поріг ALX",
    u8"Допуск оптимізації кривої ALX",
    u8"Квантування ALX"
};

static int no_vectorization_param = sizeof(vectorization_param) / sizeof(vectorization_param[0]);

#define _YES_NO_ESC_ u8"ТтНн\033"
#define _YES_ L'Т'
#define _yes_ L'т'
#define _NO_ L'Н'
#define _no_ L'н'
#define _YES__ u8"Т"
#define _NO__ u8"Н"

#define _Yes_ u8"Так"
#define _No_ u8"Ні"

#define _TOOLS_TO_INSTALL_ u8"не встановлено"
#define _INSTALL_TOOLS_ u8"Встановити необхідні пакети"

#endif

#ifdef __WINSIZE__

TCHAR greeting1[] = _T("Налаштувати вікно креслення");
TCHAR greeting2[] = _T("Використовуйте краї, щоб розтягнути вікно");
TCHAR greeting3[] = _T("Використовуйте заголовок для переміщення вікна");
TCHAR greeting4[] = _T("Натисніть всередині, щоб закінчити");

#endif

#ifdef __PCX__

#define _PROCESSED_ u8"оброблено "

#endif

#ifdef __O_HATCH1__

char _TO_MANY_OBJECTS_[]= u8"Для продовження вибрано багато об’єктів (максимум 6000)";

#endif

#ifdef __O_HATCH3__

char* vocabulary[] = { (char*)u8"   натисніть клавішу:", (char*)u8"A", (char*)u8"центр ваги", (char*)u8"Статичний момент поля", (char*)u8"Момент інерції" };

#endif

#ifdef __O_LTTYPE__

char* add_new_font = u8"додати новий шрифт";
#define LINE u8"Лінії"

char lin_config_param[31][MaxLenNameLine] =
{
	/*
	u8"Пунктирна",
	u8"Штрихпунктирна",
	u8"2-крапкова",
	u8"Крапкова",
	u8"Кордон",
	u8"Центр",
	u8"Прихована",
	u8"Фантом",
	u8"Пунктирна_2",
	u8"Штрихпунктирна_2",
	u8"2-крапкова_2",
	u8"Крапкова_2",
	u8"Кордон_2",
	u8"Центр_2",
	u8"Прихована_2",
	u8"Фантом_2",
	u8"Пунктирна_x2",
	u8"Штрихпунктирна_x2",
	u8"2-крапкова_x2",
	u8"Крапкова_x2",
	u8"Кордон_x2",
	u8"Центр_x2",
	u8"Прихована_x2",
	u8"Фантом_x2",
	u8"3-крапкова",
	u8"2-центр",
	u8"3-пунктирна",
	u8"Фантом_3",
	u8"2-центр_x2",
	u8"3-пунктирна_x2",
	u8"Багатоштрихова",
	*/
	"Dashed",
	"Dashdotted",
	"2-dotted",
	"Dotted",
	"Border",
	"Center",
	"Hidden",
	"Phantom",
	"Dashed_2",
	"Dashdotted_2",
	"2-dotted_2",
	"Dotted_2",
	"Border_2",
	"Center_2",
	"Hidden_2",
	"Phantom_2",
	"Dashed_x2",
	"Dashdotted_x2",
	"2-dotted_x2",
	"Dotted_x2",
	"Border_x2",
	"Center_x2",
	"Hidden_x2",
	"Phantom_x2",
	"3-dotted",
	"2-center",
	"3-dashed",
	"Phantom_3",
	"2-center_x2",
	"3-dashed_x2",
	"Multidashed",
};

#define CZCIONKI u8"Шрифти"
#define CZCIONKI_DXF u8"Шрифти-DXF"

char str[40] = u8"Немає файлу: ";

#endif

#ifdef __O_MEASURE__

char measure_comm[9][100] = { u8"область", u8"Точка", u8"Новий кут місцевої системи координат", u8" ->натисніть будь-яку клавішу:", u8"Кут", u8"Поточний кут місцевої системи координат:", u8"Позначити зображення двох базових точок", u8"Позначка на кресленні двох картометричних точок", u8"Кут" };
#define _SUBSTRACT_ u8"відняти"
#define _ADD_ u8"додати"

#endif

#ifdef __O_CONFIG__

static char konf_global[20] = u8"Глобальна";
static char konf_lokal[20] = u8"Локальна";
static char local_global[20] = u8"Локальна";

#define config_labels0 u8"Рамка"
#define config_labels1 u8"Фон"
#define config_labels2 u8"Текст"
#define config_labels3 u8"Курсор"
#define config_labels4 u8"Блок"
#define config_labels5 u8"Рамка"
#define config_labels6 u8"Фон"
#define config_labels7 u8"Текст"
#define config_labels8 u8"Редагувати фон"
#define config_labels9 u8"Редагувати текст"
#define config_labels10 u8"конфігурація:"
#define config_labels11 u8"інший" 

#define config_groups0 u8"КОЛЬОРИ МЕНЮ"
#define config_groups1 u8"КОЛЬОРИ СТОЛУ"

#define config_buttons0 u8"OK"
#define config_buttons1 u8"Esc"
#define config_buttons2 u8"" //"Global"
#define config_buttons3 u8"" //"Local"
#define config_buttons4 u8"Зберегти"

#define config_title  u8"К О Н Ф І Г У Р А Ц І Я"

#define image_conf_tips0  u8"@Глобальна"
#define image_conf_tips1  u8"Локальна"
 
#endif

#ifdef __O_PRNFUN__

static char err_message[] = u8"Помилка конвертації файлу. Код виходу:";
static char err_message_cups[] = u8"Помилка виконання команди 'lp'. Код виходу:";
static char confirm[] = u8"Підтвердьте";

#define _CANNOT_CREATE_PDF_ u8"помилка: неможливо створити об’єкт PdfDoc\n"
#define _FILE_WRITING_ERROR_ u8"Помилка запису файлу іміджа"

#endif


#ifdef __O_SECTION_DATA__
static char confirm[] = u8"Підтвердьте";
#define _CANNOT_OPEN_ u8"Неможливо відкрити "
#define _CANNOT_READ_ u8"Неможливо прочитати "
#define _DEFAULT_TAKEN_ u8"Прийнято стандартні параметри деревини"
#endif

#ifdef __O_STATIC__

#define _SELECT_STATE_ "Граничний стан (сочетание)"
#define _SELECT_STATE_C_ L'Г'

/*
POLE pmSelect_State[] = {
	{u8"за Тримкістю",L'Т',0,NULL},
	{u8"за Експлуатацією",L'Е',0,NULL},
    {u8"за експлуатацією (Квазіпостійний)",L'К',0,NULL},
};

static TMENU mSelect_State = { 3,0,0,32,20,7, 0,CMNU,CMBR,CMTX,0,COMNDmnr,0,0,0, (POLE(*)[]) &pmSelect_State,NULL,NULL };
*/

#define _PROCEED_STATIC_ u8"Продовжити статичний розрахунок зазначеної рами чи ферми?"

#define _incorrectly_defined_ u8"неправильно визначено"
#define _property_not_defined_ u8"властивість не визначена"
#define _reaction_not_associated_ u8"реакція не пов'язана з жодним відомим вузлом"
#define _reaction_not_enough_in_Y_ u8"Конструкція недостатньо підтримується по осі Y. Додайте відсутню опору."
#define _reaction_not_enough_in_X_ u8"Конструкція недостатньо підтримується по осі X. Додайте відсутню опору."
#define _reaction_not_enough_in_X_Y_ u8"Конструкція недостатньо підтримується по осях X та Y. Додайте відсутні опори."
#define _node_size_not_associated_ u8"розмір вузла не пов’язаний з жодним відомим вузлом"
#define _force_not_associated_ u8"не пов'язаний з жодним відомим вузлом"
#define _load_not_associated_ u8"не пов'язані з жодним відомим елементом"
#define _thermal_load_inside_element_ u8"не на весь елемент з координатами вузлів:"
#define _unknown_standard_ u8"Невідомий стандарт"
#define _element_graph_data_failed_ u8"Не вдалося створити кінцевий блок даних сил для елемента"
#define _cannot_create_folder_ u8"Не вдається створити каталог файлів"

#define _FRAME3DD_ u8"%FRAME:"
#define _FRAME3DD_PL u8"%RAMA:"
#define _FRAME3DD_UA u8"%КАРКАС:"
#define _FRAME3DD_ES u8"%MARCO:"

#define _Yes_ u8"Так"
#define _No_ u8"Ні"
#define _YES_NO_ESC_ u8"ТНтн\033"
#define _YES_ L'Т'
#define _yes_ L'т'
#define _NO_ L'Н'
#define _no_ L'н'

#define __FRAME3DD__ u8"%Frame3dd"

static char confirm[] = u8"Підтвердьте";
#define _CANNOT_CREATE_DEFORMATION_BLOCK_ u8"Не вдалося створити блок деформованої форми"
#define _CANNOT_CREATE_FORCE_BLOCK_ u8"Не вдалося створити блок графіка моменту"
#define _CANNOT_CREATE_MOMENT_BLOCK_ u8"Не вдалося створити блок графіка моменту"
#define _CANNOT_CREATE_STRESS_BLOCK_ u8"Не вдалося створити блок графіка напруги"
#define _CANNOT_CREATE_SHEAR_STRESS_BLOCK_ u8"Не вдалося створити блок графіка напруги зсуву"
#define _CANNOT_CREATE_RESULTS_FILE_ u8"Неможливо відкрити файл результатів"
#define _CANNOT_CREATE_RESULTS_PDF_FILE_ u8"Вихідний файл не можна створити у форматі PDF"
#define _CANNOT_OPEN_RESULTS_PDF_FILE_ u8"Не вдається відкрити PDF-файл результатів"
#define _INSTALL_PDF_VIEWER_ u8"Встановіть програму перегляду PDF \"Okular\" або \"Evince\""

#define _CANNOT_OPEN_DEFORMATION_DATA_FILE_ u8"Неможливо відкрити файл даних про деформацію"
#define _CANNOT_OPEN_RESULTS_DATA_FILE_ u8"Неможливо відкрити файл даних результатів"
#define _CANNOT_OPEN_DYNAMIC_RESULTS_DATA_FILE_ u8"Неможливо відкрити файл даних динамічних результатів"
#define _CANNOT_CREATE_NODES_AND_ELEMENTS_BLOCK_ u8"Неможливо створити блок вузлів і елементів"
#define _CANNOT_CREATE_REACTIONS_BLOCK_ u8"Неможливо створити блок реакцій"
#define _CANNOT_CREATE_NEW_LAYER_ u8"Неможливо створити новий шар. Для багатьох уже створених шарів"

char *frame3dd[]={
 /*0*/ u8"завершення без помилок",
 /*1*/ u8"невідома помилка",
 /*2*/ u8"помилка параметрів командного рядка (див. Розділ 11 вище)",
 /*3*/ u8"помилка параметра командного рядка для деформації зсуву -s",
 /*4*/ u8"помилка параметра командного рядка для геометричної жорсткості -g",
 /*5*/ u8"помилка параметра командного рядка для зосередженої маси -l",
 /*6*/ u8"помилка параметра командного рядка для методу модального аналізу -m",
 /*7*/ u8"помилка параметра командного рядка для допуску модального аналізу -t",
 /*8*/ u8"помилка параметра командного рядка для модального аналізу shift -f",
 /*9*/ u8"помилка з параметром командного рядка для швидкості панорамування -p",
 /*10*/ u8"помилка з параметром командного рядка для конденсації матриці -r",
 /*11*/ u8"помилка під час відкриття файлу вхідних даних",
 /*12*/ u8"помилка відкриття тимчасового очищеного файлу вхідних даних для запису",
 /*13*/ u8"помилка відкриття тимчасового очищеного файлу вхідних даних для читання",
 /*14*/ u8"помилка під час відкриття файлу вихідних даних",
 /*15*/ u8" помилка під час створення шляху для тимчасових файлів вихідних даних",
 /*16*/ u8" помилка під час створення імені шляху до файлу тимчасових вихідних даних",
 /*17*/ u8"помилка під час відкриття файлу вихідних даних .CSV (електронна таблиця)",
 /*18*/ u8"помилка під час відкриття файлу вихідних даних .M (matlab)",
 /*19*/ u8"помилка під час відкриття файлу вихідних даних внутрішньої сили для запису",
 /*20*/ u8"помилка відкриття файлу вихідних даних внутрішньої сили для читання",
 /*21*/ u8"помилка під час відкриття файлу вихідних даних недеформованої сітки",
 /*22*/ u8"помилка під час відкриття файлу вихідних даних деформованої сітки",
 /*23*/ u8"помилка під час відкриття файлу сценарію побудови для запису перших графіків статичного навантаження",
 /*24*/ u8"помилка під час відкриття файлу сценарію побудови для додавання результатів другого та вищого статичного навантаження",
 /*25*/ u8"помилка під час відкриття файлу сценарію побудови для додавання модальних графіків",
 /*26*/ u8"помилка під час відкриття файлу сценарію побудови для додавання модальних анімацій",
 /*27*/ u8"помилка під час відкриття файлу даних модальної сітки",
 /*28*/ u8"помилка під час відкриття файлу даних анімації модальної сітки",
 /*29*/ u8"помилка під час відкриття файлу налагодження масових даних, MassData.txt",
 /*30*/ u8"матриця системи кубічної кривої для деформації елемента не є позитивно визначеною",
 /*31*/ u8"непозитивна визначена структурна статична матриця жорсткості",
 /*32*/ u8"помилка аналізу власних значень. Повторіть спробу зі зменшеною чи нульовою кількістю динамічних режимів",
 /*33*/ u8"завершення без помилок",
 /*34*/ u8"завершення без помилок",
 /*35*/ u8"завершення без помилок",
 /*36*/ u8"завершення без помилок",
 /*37*/ u8"завершення без помилок",
 /*38*/ u8"завершення без помилок",
 /*39*/ u8"завершення без помилок",
 /*40*/ u8"помилка у файлі вхідних даних",
 /*41*/ u8"помилка форматування вхідних даних у даних вузла, номер вузла поза діапазоном",
 /*42*/ u8"помилка форматування вхідних даних у даних вузла або елемента, непідключений вузол",
 /*43*/ u8"завершення без помилок",
 /*44*/ u8"завершення без помилок",
 /*45*/ u8"завершення без помилок",
 /*46*/ u8"завершення без помилок",
 /*47*/ u8"завершення без помилок",
 /*48*/ u8"завершення без помилок",
 /*49*/ u8"завершення без помилок",
 /*50*/ u8"завершення без помилок",
 /*51*/ u8"помилка форматування вхідних даних у даних елемента кадру, номер елемента кадру поза діапазоном",
 /*52*/ u8"помилка форматування вхідних даних у даних елемента кадру, номер вузла поза діапазоном",
 /*53*/ u8"помилка форматування вхідних даних у даних елемента кадру, негативне значення розділу",
 /*54*/ u8"помилка форматування вхідних даних у даних елемента кадру, площа поперечного перерізу 0 (нуль)",
 /*55*/ u8"помилка форматування вхідних даних у даних елемента кадру, площа зсуву та модуль зсуву 0 (нуль)",
 /*56*/ u8"помилка форматування вхідних даних у даних елемента рами, крутильний момент інерції 0 (нуль)",
 /*57*/ u8"помилка форматування вхідних даних у даних елемента кадру, згинальний момент інерції 0 (нуль)",
 /*58*/ u8"помилка форматування вхідних даних у даних елемента кадру, значення модуля не додатне",
 /*59*/ u8"помилка форматування вхідних даних у даних елемента кадру, значення масової щільності не додатне",
 /*60*/ u8"nput помилка форматування даних у даних елемента фрейму, елемент фрейму починається та зупиняється на тому самому вузлі",
 /*61*/ u8"помилка форматування вхідних даних у даних елемента кадру, елемент кадру має нульову довжину",
 /*62*/ u8"завершення без помилок",
 /*63*/ u8"завершення без помилок",
 /*64*/ u8"завершення без помилок",
 /*65*/ u8"завершення без помилок",
 /*66*/ u8"завершення без помилок",
 /*67*/ u8"завершення без помилок",
 /*68*/ u8"завершення без помилок",
 /*69*/ u8"завершення без помилок",
 /*70*/ u8"завершення без помилок",
 /*71*/ u8"помилка форматування вхідних даних зі змінною 'shear', що визначає деформацію зсуву",
 /*72*/ u8"помилка форматування вхідних даних зі змінною 'geom', що визначає геометричну жорсткість",
 /*73*/ u8"помилка форматування вхідних даних зі змінною 'exagg_static', що вказує на перевищення статичної сітки",
 /*74*/ u8"помилка форматування вхідних даних зі змінною 'dx', що визначає довжину приросту внутрішньої сили по осі x",
 /*75*/ u8"завершення без помилок",
 /*76*/ u8"завершення без помилок",
 /*77*/ u8"завершення без помилок",
 /*78*/ u8"завершення без помилок",
 /*79*/ u8"завершення без помилок",
 /*80*/ u8"помилка форматування вхідних даних у даних реакції, кількість вузлів із реакціями поза діапазоном",
 /*81*/ u8"помилка форматування вхідних даних у даних реакції, номер вузла поза діапазоном",
 /*82*/ u8"помилка форматування вхідних даних у даних реакції, дані реакції не 1 (один) або 0 (нуль)",
 /*83*/ u8"помилка форматування вхідних даних у даних реакції, вказаний вузол не реагує",
 /*84*/ u8"помилка форматування вхідних даних у даних реакції, недостатньо обмежена структура",
 /*85*/ u8"помилка форматування вхідних даних у даних реакції, повністю обмежена структура",
 /*86*/ u8"помилка форматування вхідних даних у даних інерції додаткового вузла, номер вузла поза діапазоном",
 /*87*/ u8"помилка форматування вхідних даних у даних маси додаткового променя, номер елемента кадру поза діапазоном",
 /*88*/ u8"помилка форматування вхідних даних у масових даних, елемент кадру з недодатною масою",
 /*89*/ u8"завершення без помилок",
 /*90*/ u8"помилка форматування вхідних даних у даних конденсації матриці, кількість вузлів із конденсованими ступенями свободи менша за загальну кількість вузлів",
 /*91*/ u8"помилка форматування вхідних даних у даних ущільнення матриці, номер вузла поза діапазоном",
 /*92*/ u8"помилка форматування вхідних даних у даних ущільнення матриці, номер режиму поза діапазоном",
 /*93*/ u8"завершення без помилок",
 /*94*/ u8"помилка форматування вхідних даних у даних конденсації матриці, кількість конденсованих ступенів свободи перевищує кількість мод",
 /*95*/ u8"завершення без помилок",
 /*96*/ u8"завершення без помилок",
 /*97*/ u8"завершення без помилок",
 /*98*/ u8"завершення без помилок",
 /*99*/ u8"завершення без помилок",
 /*100*/ u8"помилка форматування вхідних даних під час завантаження даних",
 /*101*/ u8"кількість статичних навантажень має бути більше нуля",
 /*102*/ u8"кількість статичних навантажень має бути менше 112",  //64  30
 /*103*/ u8"завершення без помилок",
 /*104*/ u8"завершення без помилок",
 /*105*/ u8"завершення без помилок",
 /*106*/ u8"завершення без помилок",
 /*107*/ u8"завершення без помилок",
 /*108*/ u8"завершення без помилок",
 /*109*/ u8"завершення без помилок",
 /*110*/ u8"завершення без помилок",
 /*111*/ u8"завершення без помилок",
 /*112*/ u8"завершення без помилок",
 /*113*/ u8"завершення без помилок",
 /*114*/ u8"завершення без помилок",
 /*115*/ u8"завершення без помилок",
 /*116*/ u8"завершення без помилок",
 /*117*/ u8"завершення без помилок",
 /*118*/ u8"завершення без помилок",
 /*119*/ u8"завершення без помилок",
 /*120*/ u8"завершення без помилок",
 /*121*/ u8"помилка форматування вхідних даних у даних вузлового навантаження, номер вузла поза діапазоном",
 /*122*/ u8"завершення без помилок",
 /*123*/ u8"завершення без помилок",
 /*124*/ u8"завершення без помилок",
 /*125*/ u8"завершення без помилок",
 /*126*/ u8"завершення без помилок",
 /*127*/ u8"завершення без помилок",
 /*128*/ u8"завершення без помилок",
 /*129*/ u8"завершення без помилок",
 /*130*/ u8"завершення без помилок",
 /*131*/ u8"помилка форматування вхідних даних у даних рівномірно розподіленого навантаження, кількість рівномірних завантажень перевищує кількість елементів фрейму",
 /*132*/ u8"помилка форматування вхідних даних у рівномірно розподілених даних навантаження, номер елемента кадру поза діапазоном",
 /*133*/ u8"завершення без помилок",
 /*134*/ u8"завершення без помилок",
 /*135*/ u8"завершення без помилок",
 /*136*/ u8"завершення без помилок",
 /*137*/ u8"завершення без помилок",
 /*138*/ u8"завершення без помилок",
 /*139*/ u8"завершення без помилок",
 /*140*/ u8"помилка форматування вхідних даних у даних про трапецієподібно розподілене навантаження, занадто багато трапецієподібно розподілених навантажень",
 /*141*/ u8"помилка форматування вхідних даних у даних трапецієподібно розподіленого навантаження, номер елемента кадру поза діапазоном",
 /*142*/ u8"помилка форматування вхідних даних у даних трапецієподібно розподіленого навантаження, x1 < 0",
 /*143*/ u8"помилка форматування вхідних даних у даних трапецієподібно розподіленого навантаження, x1 > x2",
 /*144*/ u8"помилка форматування вхідних даних у даних трапецієподібно розподіленого навантаження, x2 > L",
 /*145*/ u8"завершення без помилок",
 /*146*/ u8"завершення без помилок",
 /*147*/ u8"завершення без помилок",
 /*148*/ u8"завершення без помилок",
 /*149*/ u8"завершення без помилок",
 /*150*/ u8"помилка форматування вхідних даних у даних зосередженого внутрішнього завантаження, кількість зосереджених завантажень перевищує кількість елементів кадру",
 /*151*/ u8"помилка форматування вхідних даних у даних внутрішнього зосередженого навантаження, номер елемента кадру поза діапазоном",
 /*152*/ u8"помилка форматування вхідних даних у даних внутрішнього зосередженого завантаження, x-розташування менше 0 або більше L",
 /*153*/ u8"завершення без помилок",
 /*154*/ u8"завершення без помилок",
 /*155*/ u8"завершення без помилок",
 /*156*/ u8"завершення без помилок",
 /*157*/ u8"завершення без помилок",
 /*158*/ u8"завершення без помилок",
 /*159*/ u8"завершення без помилок",
 /*160*/ u8"помилка форматування вхідних даних у даних теплового навантаження, кількість теплових навантажень перевищує кількість елементів рами",
 /*161*/ u8"помилка форматування вхідних даних у даних теплового навантаження, номер елемента рами поза діапазоном",
 /*162*/ u8"помилка форматування вхідних даних у даних теплового навантаження, номер елемента кадру поза діапазоном",
 /*163*/ u8"завершення без помилок",
 /*164*/ u8"завершення без помилок",
 /*165*/ u8"завершення без помилок",
 /*166*/ u8"завершення без помилок",
 /*167*/ u8"завершення без помилок",
 /*168*/ u8"завершення без помилок",
 /*169*/ u8"завершення без помилок",
 /*170*/ u8"завершення без помилок",
 /*171*/ u8"помилка форматування вхідних даних у заданих даних переміщення, задані переміщення можна застосовувати лише в координатах з реакціями",
 /*172*/ u8"завершення без помилок",
 /*173*/ u8"завершення без помилок",
 /*174*/ u8"завершення без помилок",
 /*175*/ u8"завершення без помилок",
 /*176*/ u8"завершення без помилок",
 /*177*/ u8"завершення без помилок",
 /*178*/ u8"завершення без помилок",
 /*179*/ u8"завершення без помилок",
 /*180*/ u8"завершення без помилок",
 /*181*/ u8"УВАГА: пружна нестабільність (пружна + матриця геометричної жорсткості не позитивно визначена)",
 /*182*/ u8"УВАГА: велика деформація (середня осьова деформація в одному або кількох елементах перевищує 0,001)",
 /*183*/ u8"УВАГА: велика деформація та пружна нестабільність",
 /*184*/ u8"завершення без помилок",
 /*185*/ u8"завершення без помилок",
 /*186*/ u8"завершення без помилок",
 /*187*/ u8"завершення без помилок",
 /*188*/ u8"завершення без помилок",
 /*189*/ u8"завершення без помилок",
 /*190*/ u8"завершення без помилок",
 /*191*/ u8"завершення без помилок",
 /*192*/ u8"завершення без помилок",
 /*193*/ u8"завершення без помилок",
 /*194*/ u8"завершення без помилок",
 /*195*/ u8"завершення без помилок",
 /*196*/ u8"завершення без помилок",
 /*197*/ u8"завершення без помилок",
 /*198*/ u8"завершення без помилок",
 /*199*/ u8"завершення без помилок",
 /*200*/ u8"помилка розподілу пам'яті",
 /*201*/ u8"помилка під час відкриття файлу вихідних даних із збереженням вектора 'float'",
 /*202*/ u8"помилка відкриття файлу вихідних даних із збереженням вектора 'ints'",
 /*203*/ u8"помилка під час відкриття файлу вихідних даних із збереженням матриці 'float'",
 /*204*/ u8"помилка під час відкриття файлу вихідних даних із збереженням матриці 'подвійних'",
 /*205*/ u8"помилка під час відкриття файлу вихідних даних із збереженням симетричної матриці 'float'",
 /*206*/ u8"помилка під час відкриття файлу вихідних даних із збереженням симетричної матриці 'подвійних'",
 /*207*/ u8"похибка тесту рівноваги",
 /*208*/ u8"помилка відкриття файлу журналу помилок .err",
};

#define _ERROR_FREE_COMPLETION_ u8"завершення без помилок"

#endif

#ifdef __O_PLATE__

#define _PLATE_ u8"%PLATE:"
#define _PLATE_PL u8"%PŁYTA:"
#define _PLATE_UA u8"%ПЛИТА:"
#define _PLATE_ES u8"%LOSA:"

#define _cannot_create_folder_ u8"Не вдається створити каталог файлів"
#define _CANNOT_CREATE_RESULTS_FILE_ u8"Неможливо відкрити файл результатів"
static char confirm[] = u8"Підтвердьте";

#define _gmsh_error_ u8"Помилка gmsh"
#define _ElmerGrid_error_ u8"Помилка ElmerGrid"
#define _ElmerSolver_error_ u8"Помилка ElmerSolver"

#define _CANNOT_OPEN_RESULTS_FILE_ u8"Не вдається відкрити файл результатів"
#define _CANNOT_READ_RESULTS_FILE_ u8"Не вдалося прочитати файл результатів"

#define _CANNOT_CREATE_NEW_LAYER_ u8"Неможливо створити новий шар. Для багатьох уже створених шарів"
#define _CANNOT_CREATE_NODES_AND_ELEMENTS_BLOCK_ u8"Неможливо створити блок вузлів і елементів"
#define _CANNOT_CREATE_DEFLECTION_BLOCK_ u8"Неможливо створити блок відхилення"
#define _CANNOT_CREATE_STRESS_BLOCK_ u8"Неможливо створити блок напружень"
#define _CANNOT_CREATE_STRAIN_BLOCK_ u8"Неможливо створити блок зсувних деформацій"

#define _PROCEED_PLATE_FEM_ u8"Продовжити статичний розрахунок зазначеної плити?"

#define _POLYLINE_IS_NOT_CLOSED_ u8"полілінія не замкнута"
#define _THE_PLATE_ u8"Плита"
#define _THE_HOLE_ u8"Отвір"
#define _THE_WALL_ u8"Стіна"
#define _THE_ZONE_ u8"Зона"
#define _THE_PLATE_POLYLINE_NUMBER_IS_EQUAL_ZERO_ u8"Кількість поліліній плит дорівнює 0"
#define _THE_PLATE_POLYLINE_NUMBER_IS_GREATER_THAN_ONE_ u8"Кількість поліліній плит перекриття перевищує 1. Таке рішення ще не реалізовано."
#define _NO_LOAD_ASSIGNED_ u8"Навантаження не призначено, і для власної ваги не заявлено значення «%g»"

#define _THE_HOLE_NOT_ASSIGNED_TO_ZONE_OR_PLATE_ u8"Отвір не призначено жодній зоні чи плиті"
#define _THE_WALL_NOT_ASSIGNED_TO_ZONE_OR_PLATE_ u8"Стіна не призначена жодній зоні чи плиті"
#define _THE_ZONE_NOT_ASSIGNED_TO_PLATE_ u8"Зона не призначена жодній плиті перекриття"

#define _THE_ZONE_IS_ASSIGNED_TO_ANOTHER_ZONE_ u8"Зона знаходиться всередині іншої зони, що поки що заборонено"

#define _Yes_ u8"Так"
#define _No_ u8"Ні"
#define _YES_NO_ESC_ u8"ТНтн\033"
#define _YES_ L'Т'
#define _yes_ L'т'
#define _NO_ L'Н'
#define _no_ L'н'

#define _CANNOT_PROCEED_IN_32BIT_ u8"Плата виглядає нормально, але обчислювальний модуль Elmer FEM не працює в 32-бітній системі"
#define _BUY_NEW_COMPUTER_  u8"Купіть новий комп'ютер"
#define _unknown_standard_ u8"Невідомий стандарт"

#endif

#ifdef __O_TEXT3PDF__
#define _CANNOT_CREATE_PDF_ u8"помилка: неможливо створити об’єкт PdfDoc\n"
#endif

#ifdef __O_ANIMATE_DYN__

#define _ANIMATE_ u8"ESC: exit, BackSpace: previous, any other: next"

#endif

#ifdef __O_SEL__

#define _FIRST_  u8"ПЕРШИЙ"
#define _SECOND_ u8"ДРУГИЙ"

#endif